src/SetStar.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SetStar xmlns="http://tempuri.org/">
      <strTaskID>&strTaskID</strTaskID>
      <strStatus>&strStatus</strStatus>
    </SetStar>
  </soap:Body>
</soap:Envelope>